QuantumLeaps/qpc/3rd_party/STM32CubeH7/nucleo-h743zi/gnu/startup_stm32h743xx.c
    /*IRQ handlers... */
    (int)&WWDG_IRQHandler,          /* Window WatchDog Interrupt ( wwdg1_it)   */
    (int)&PVD_AVD_IRQHandler,       /* PVD/AVD through EXTI Line detection     */
    (int)&TAMP_STAMP_IRQHandler,    /* Tamper and TimeStamps through EXTI line */
    (int)&RTC_WKUP_IRQHandler,      /* RTC Wakeup through the EXTI line    */
    (int)&FLASH_IRQHandler,         /* FLASH                               */
    (int)&RCC_IRQHandler,           /* RCC                                 */
    (int)&EXTI0_IRQHandler,         /* EXTI Line0                          */
    (int)&EXTI1_IRQHandler,         /* EXTI Line1                          */
    (int)&EXTI2_IRQHandler,         /* EXTI Line2                          */
    (int)&EXTI3_IRQHandler,         /* EXTI Line3                          */
    (int)&EXTI4_IRQHandler,         /* EXTI Line4                          */
    (int)&DMA1_Stream0_IRQHandler,  /* DMA1 Stream 0                       */
    (int)&DMA1_Stream1_IRQHandler,  /* DMA1 Stream 1                       */
    (int)&DMA1_Stream2_IRQHandler,  /* DMA1 Stream 2                       */
    (int)&DMA1_Stream3_IRQHandler,  /* DMA1 Stream 3                       */
    (int)&DMA1_Stream4_IRQHandler,  /* DMA1 Stream 4                       */
    (int)&DMA1_Stream5_IRQHandler,  /* DMA1 Stream 5                       */
    (int)&DMA1_Stream6_IRQHandler,  /* DMA1 Stream 6                       */
    (int)&ADC_IRQHandler,           /* ADC1, ADC2                          */
    (int)&FDCAN1_IT0_IRQHandler,    /* FDCAN1 interrupt line 0             */
    (int)&FDCAN2_IT0_IRQHandler,    /* FDCAN2 interrupt line 0             */
    (int)&FDCAN1_IT1_IRQHandler,    /* FDCAN1 interrupt line 1             */
    (int)&FDCAN2_IT1_IRQHandler,    /* FDCAN2 interrupt line 1             */
    (int)&EXTI9_5_IRQHandler,       /* External Line[9:5]s                 */
    (int)&TIM1_BRK_IRQHandler,      /* TIM1 Break interrupt                */
    (int)&TIM1_UP_IRQHandler,       /* TIM1 Update                         */
    (int)&TIM1_TRG_COM_IRQHandler,  /* TIM1 Trigger and Commutation Interrupt */
    (int)&TIM1_CC_IRQHandler,       /* TIM1 Capture Compare                */
    (int)&TIM2_IRQHandler,          /* TIM2                                */
    (int)&TIM3_IRQHandler,          /* TIM3                                */
    (int)&TIM4_IRQHandler,          /* TIM4                                */
    (int)&I2C1_EV_IRQHandler,       /* I2C1 Event                          */
    (int)&I2C1_ER_IRQHandler,       /* I2C1 Error                          */
    (int)&I2C2_EV_IRQHandler,       /* I2C2 Event                          */
    (int)&I2C2_ER_IRQHandler,       /* I2C2 Error                          */
    (int)&SPI1_IRQHandler,          /* SPI1                                */
    (int)&SPI2_IRQHandler,          /* SPI2                                */
    (int)&USART1_IRQHandler,        /* USART1                              */
    (int)&USART2_IRQHandler,        /* USART2                              */
    (int)&USART3_IRQHandler,        /* USART3                              */
    (int)&EXTI15_10_IRQHandler,     /* External Line[15:10]                */
    (int)&RTC_Alarm_IRQHandler,     /* RTC Alarm (A and B) through EXTI Line*/
    (int)0,                         /* Reserved                             */
    (int)&TIM8_BRK_TIM12_IRQHandler,/* TIM8 Break Interrupt and TIM12 global interrupt */
    (int)&TIM8_UP_TIM13_IRQHandler, /* TIM8 Update Interrupt and TIM13 global interrupt */
    (int)&TIM8_TRG_COM_TIM14_IRQHandler, /* TIM8 Trigger and Commutation Interrupt and TIM14 glob */
    (int)&TIM8_CC_IRQHandler,       /* TIM8 Capture Compare Interrupt      */
    (int)&DMA1_Stream7_IRQHandler,  /* DMA1 Stream7                        */
    (int)&FMC_IRQHandler,           /* FMC                                 */
    (int)&SDMMC1_IRQHandler,        /* SDMMC1                              */
    (int)&TIM5_IRQHandler,          /* TIM5                                */
    (int)&SPI3_IRQHandler,          /* SPI3                                */
    (int)&UART4_IRQHandler,         /* UART4                               */
    (int)&UART5_IRQHandler,         /* UART5                               */
    (int)&TIM6_DAC_IRQHandler,      /* TIM6 and DAC1&2 underrun errors     */
    (int)&TIM7_IRQHandler,          /* TIM7                                */
    (int)&DMA2_Stream0_IRQHandler,  /* DMA2 Stream 0                       */
    (int)&DMA2_Stream1_IRQHandler,  /* DMA2 Stream 1                       */
    (int)&DMA2_Stream2_IRQHandler,  /* DMA2 Stream 2                       */
    (int)&DMA2_Stream3_IRQHandler,  /* DMA2 Stream 3                       */
    (int)&DMA2_Stream4_IRQHandler,  /* DMA2 Stream 4                       */
    (int)&ETH_IRQHandler,           /* Ethernet                            */
    (int)&ETH_WKUP_IRQHandler,      /* Ethernet Wakeup through EXTI line   */
    (int)&FDCAN_CAL_IRQHandler,     /* FDCAN calibration unit interrupt    */
    (int)0,                         /* Reserved                            */
    (int)0,                         /* Reserved                            */
    (int)0,                         /* Reserved                            */
    (int)0,                         /* Reserved                            */
    (int)&DMA2_Stream5_IRQHandler,  /* DMA2 Stream 5                       */
    (int)&DMA2_Stream6_IRQHandler,  /* DMA2 Stream 6                       */
    (int)&DMA2_Stream7_IRQHandler,  /* DMA2 Stream 7                       */
    (int)&USART6_IRQHandler,        /* USART6                              */
    (int)&I2C3_EV_IRQHandler,       /* I2C3 event                          */
    (int)&I2C3_ER_IRQHandler,       /* I2C3 error                          */
    (int)&OTG_HS_EP1_OUT_IRQHandler,/* USB OTG HS End Point 1 Out          */
    (int)&OTG_HS_EP1_IN_IRQHandler, /* USB OTG HS End Point 1 In           */
    (int)&OTG_HS_WKUP_IRQHandler,   /* USB OTG HS Wakeup through EXTI      */
    (int)&OTG_HS_IRQHandler,        /* USB OTG HS                          */
    (int)&DCMI_IRQHandler,          /* DCMI                                */
    (int)0,                         /* Reserved                            */
    (int)&RNG_IRQHandler,           /* Rng                                 */
    (int)&FPU_IRQHandler,           /* FPU                                 */
    (int)&UART7_IRQHandler,         /* UART7                               */
    (int)&UART8_IRQHandler,         /* UART8                               */
    (int)&SPI4_IRQHandler,          /* SPI4                                */
    (int)&SPI5_IRQHandler,          /* SPI5                                */
    (int)&SPI6_IRQHandler,          /* SPI6                                */
    (int)&SAI1_IRQHandler,          /* SAI1                                */
    (int)&LTDC_IRQHandler,          /* LTDC                                */
    (int)&LTDC_ER_IRQHandler,       /* LTDC error                          */
    (int)&DMA2D_IRQHandler,         /* DMA2D                               */
    (int)&SAI2_IRQHandler,          /* SAI2                                */
    (int)&QUADSPI_IRQHandler,       /* QUADSPI                             */
    (int)&LPTIM1_IRQHandler,        /* LPTIM1                              */
    (int)&CEC_IRQHandler,           /* HDMI_CEC                            */
    (int)&I2C4_EV_IRQHandler,       /* I2C4 Event                          */
    (int)&I2C4_ER_IRQHandler,       /* I2C4 Error                          */
    (int)&SPDIF_RX_IRQHandler,      /* SPDIF_RX                            */
    (int)&OTG_FS_EP1_OUT_IRQHandler,/* USB OTG FS End Point 1 Out          */
    (int)&OTG_FS_EP1_IN_IRQHandler, /* USB OTG FS End Point 1 In           */
    (int)&OTG_FS_WKUP_IRQHandler,   /* USB OTG FS Wakeup through EXTI      */
    (int)&OTG_FS_IRQHandler,        /* USB OTG FS                          */
    (int)&DMAMUX1_OVR_IRQHandler,   /* DMAMUX1 Overrun interrupt           */
    (int)&HRTIM1_Master_IRQHandler, /* HRTIM Master Timer global Interrupts */
    (int)&HRTIM1_TIMA_IRQHandler,   /* HRTIM Timer A global Interrupt      */
    (int)&HRTIM1_TIMB_IRQHandler,   /* HRTIM Timer B global Interrupt      */
    (int)&HRTIM1_TIMC_IRQHandler,   /* HRTIM Timer C global Interrupt      */
    (int)&HRTIM1_TIMD_IRQHandler,   /* HRTIM Timer D global Interrupt      */
    (int)&HRTIM1_TIME_IRQHandler,   /* HRTIM Timer E global Interrupt      */
    (int)&HRTIM1_FLT_IRQHandler,    /* HRTIM Fault global Interrupt        */
    (int)&DFSDM1_FLT0_IRQHandler,   /* DFSDM Filter0 Interrupt             */
    (int)&DFSDM1_FLT1_IRQHandler,   /* DFSDM Filter1 Interrupt             */
    (int)&DFSDM1_FLT2_IRQHandler,   /* DFSDM Filter2 Interrupt             */
    (int)&DFSDM1_FLT3_IRQHandler,   /* DFSDM Filter3 Interrupt             */
    (int)&SAI3_IRQHandler,          /* SAI3 global Interrupt               */
    (int)&SWPMI1_IRQHandler,        /* Serial Wire Interface 1 global interrupt */
    (int)&TIM15_IRQHandler,         /* TIM15 global Interrupt              */
    (int)&TIM16_IRQHandler,         /* TIM16 global Interrupt              */
    (int)&TIM17_IRQHandler,         /* TIM17 global Interrupt              */
    (int)&MDIOS_WKUP_IRQHandler,    /* MDIOS Wakeup  Interrupt             */
    (int)&MDIOS_IRQHandler,         /* MDIOS global Interrupt              */
    (int)&JPEG_IRQHandler,          /* JPEG global Interrupt               */
    (int)&MDMA_IRQHandler,          /* MDMA global Interrupt               */
    (int)0,                         /* Reserved                            */
    (int)&SDMMC2_IRQHandler,        /* SDMMC2 global Interrupt             */
    (int)&HSEM1_IRQHandler,         /* HSEM1 global Interrupt              */
    (int)0,                         /* Reserved                            */
    (int)&ADC3_IRQHandler,          /* ADC3 global Interrupt               */
    (int)&DMAMUX2_OVR_IRQHandler,   /* DMAMUX Overrun interrupt            */
    (int)&BDMA_Channel0_IRQHandler, /* BDMA Channel 0 global Interrupt     */
    (int)&BDMA_Channel1_IRQHandler, /* BDMA Channel 1 global Interrupt     */
    (int)&BDMA_Channel2_IRQHandler, /* BDMA Channel 2 global Interrupt     */
    (int)&BDMA_Channel3_IRQHandler, /* BDMA Channel 3 global Interrupt     */
    (int)&BDMA_Channel4_IRQHandler, /* BDMA Channel 4 global Interrupt     */
    (int)&BDMA_Channel5_IRQHandler, /* BDMA Channel 5 global Interrupt     */
    (int)&BDMA_Channel6_IRQHandler, /* BDMA Channel 6 global Interrupt     */
    (int)&BDMA_Channel7_IRQHandler, /* BDMA Channel 7 global Interrupt     */
    (int)&COMP1_IRQHandler,         /* COMP1 global Interrupt              */
    (int)&LPTIM2_IRQHandler,        /* LP TIM2 global interrupt            */
    (int)&LPTIM3_IRQHandler,        /* LP TIM3 global interrupt            */
    (int)&LPTIM4_IRQHandler,        /* LP TIM4 global interrupt            */
    (int)&LPTIM5_IRQHandler,        /* LP TIM5 global interrupt            */
    (int)&LPUART1_IRQHandler,       /* LP UART1 interrupt                  */
    (int)0,                         /* Reserved                            */
    (int)&CRS_IRQHandler,           /* Clock Recovery Global Interrupt     */
    (int)0,                         /* Reserved                            */
    (int)&SAI4_IRQHandler,          /* SAI4 global interrupt               */
    (int)0,                         /* Reserved                            */
    (int)0,                         /* Reserved                            */
    (int)&WAKEUP_PIN_IRQHandler     /* Interrupt for all 6 wake-up pins    */
};

